lib/tasks/insert_scrape_csv.rake

INSERT INTO "libraries" ("name", "street_address", "number", "created_at", "updated_at", "city", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", nil], ["street_address", "qwe"], ["number", nil], ["created_at", "2023-04-16 12:41:37.554401"], ["updated_at", "2023-04-16 12:41:37.554401"], ["city", nil], ["zip_code", nil]]
---
task insert_scrape_csv: :environment do
  require 'csv'

  table = CSV.parse(File.read("lib/tasks/data/libraries_4.csv"), headers: true)

  (0..table.count - 1).each { |x|
      # Library.new(street_address: 'qwe').save
      Library.new(
        name: table[x]['Library Name'],
        street_address: table[x]['Street Address'],
        library_id: table[x]['Library ID'],
        city: table[x]['City'],
        zip_code: table[x]['Zip Code'],
      ).save