app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @author = Author.all

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "a12"], ["updated_at", "2023-04-01 14:23:41.640616"], ["id", 1]]
---
  def update
    @author = Author.find(params[:id])
    if (@author.update(author_params))

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "a1"], ["created_at", "2023-04-01 14:18:17.920753"], ["updated_at", "2023-04-01 14:18:17.920753"]]
---
  def create
    # render plain: params[:post].inspect
    @author = Author.new(author_params)

    if (@author.save)