app/controllers/books_controller.rb

  def edit
    @books = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    @books = Book.find(params[:id])
    @books.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 980190962]]

  def create
    # render plain: params[:post].inspect
    @book = Book.new(book_params)

    if (@book.save)
---
INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "name1"], ["description", nil], ["created_at", "2023-04-01 12:12:33.650785"], ["updated_at", "2023-04-01 12:12:33.650785"]]