app/controllers/genres_controller.rb

  def index
    @genre = Genre.all
---
SELECT "genres".* FROM "genres"

  def update
    @genre = Genre.find(params[:id])
    if (@genre.update(genre_params))
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ge11"], ["updated_at", "2023-04-01 14:50:24.727424"], ["id", 1]]

  def create
    # render plain: params[:post].inspect
    @genre = Genre.new(genre_params)

    if (@genre.save)
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ge1"], ["created_at", "2023-04-01 14:48:27.258557"], ["updated_at", "2023-04-01 14:48:27.258557"]]