app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    @library = Library.all

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @library = Library.find(params[:id])

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "libraries" SET "name" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["name", "name11"], ["updated_at", "2023-04-01 12:02:14.292554"], ["id", 1]]
---
  def update
    @library = Library.find(params[:id])
    if (@library.update(library_params))

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 2]]
---
  def destroy
    @library = Library.find(params[:id])
    @library.destroy

INSERT INTO "libraries" ("name", "address", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "name1"], ["address", "address1"], ["number", 11111], ["created_at", "2023-04-01 11:52:33.946304"], ["updated_at", "2023-04-01 11:52:33.946304"]]
---
  def create
    # render plain: params[:post].inspect
    @library = Library.new(library_params)

    if (@library.save)

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @library = Library.find(params[:id])